app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`, `role`) VALUES ('fran2', 'rissonefran2@gmail.com', '$2y$10$nbddOe8Aw16ggsBHJBNEQeccoRc/0ybI4VbqW6vxO2EMfn6OWBTh6', 'comprador')
---
        }

        $userModel = new UserModel();
        $userModel->insert([
           'name' => $name,
           'email' => $email,
           'password' => password_hash($password, PASSWORD_DEFAULT),
           'role' => $role
        ]);