app/Controllers/Home.php

SELECT *
FROM `libros`
---
    public function index()
    {
        // Creamos instancia del modelo de libros
        $libroModel = new LibroModel();

        // Obtenemos todos los libros de la base de datos
        $data['libros'] = $libroModel->findAll();