app/Controllers/Perfil.php

    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $user = $userModel->find($session->get('userId'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '6'

    public function actualizar()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return $this->response->setJSON(['success' => false, 'message' => 'No autorizado']);
        }

        $userId = $session->get('userId');
        $userModel = new UserModel();

        $data = [
            'name'  => $this->request->getPost('name'),
            'email' => $this->request->getPost('email')
        ];

        // Manejar subida de imagen directamente
        $file = $this->request->getFile('foto_perfil');
        if ($file && $file->isValid()) {
            $uploadDir = FCPATH . 'ppimages/';
            if (!is_dir($uploadDir)) mkdir($uploadDir, 0755, true);

            $newName = $file->getRandomName();

            if ($file->move($uploadDir, $newName)) {
                // Eliminar foto anterior si existe
                $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '6'

        }

        // Actualizar usuario
        if ($userModel->update($userId, $data)) {
---
UPDATE `users` SET `name` = 'Pepe higienica', `email` = 'pepepepito@gmail.coma', `foto_perfil` = '1762976624_0929f0764d47166172ba.png'
WHERE `users`.`id` IN ('6')