app/Models/AdminKeyModel.php

    public function getCurrentKey()//→ Obtiene la última clave guardada (por si se cambia con el tiempo).
    {
        return $this->orderBy('id', 'DESC')->first();
---
SELECT *
FROM `admin_keys`
ORDER BY `id` DESC
 LIMIT 1