app/Models/MovimientosModel.php

    public function getMovimientos(){
    return $this->select('ventas.*, users.name as comprador_nombre, libros.titulo as libro_titulo, ventas.met_pago')
                ->join('users', 'users.id = ventas.comprador_id', 'left')
                ->join('libros', 'libros.id = ventas.libro_id', 'left')
                ->orderBy('ventas.fecha_de_pago', 'DESC')
                ->orderBy('ventas.venta_id', 'DESC')
                ->findAll();
---
SELECT `ventas`.*, `users`.`name` as `comprador_nombre`, `libros`.`titulo` as `libro_titulo`, `ventas`.`met_pago`
FROM `ventas`
LEFT JOIN `users` ON `users`.`id` = `ventas`.`comprador_id`
LEFT JOIN `libros` ON `libros`.`id` = `ventas`.`libro_id`
ORDER BY `ventas`.`fecha_de_pago` DESC, `ventas`.`venta_id` DESC

    public function getTotalVentas()
    {
        $result = $this->selectSum('monto_venta')->get()->getRow();
---
SELECT SUM(`monto_venta`) AS `monto_venta`
FROM `ventas`