app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'emarissopatron@gmail.com'
 LIMIT 1
---
    public function findByEmail($email)
    {
        return $this->where('email', $email)->first();