app/Models/VendorKeyModel.php

    public function getCurrentKey()
    {
        return $this->orderBy('id','DESC')->first();
---
SELECT *
FROM `vendor_keys`
ORDER BY `id` DESC
 LIMIT 1